DataProcessors/омг_ДополнительныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_ДополнительныеФормы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВнутренняяЛаборатория_СопоставлениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВнутренняяЛаборатория_СопоставлениеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КоличествоИсследований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КодГруппыЗабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КоличествоКонтейнеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_Преаналитика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биоматериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутренняяЛаборатория_Биоматериалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутренняяЛаборатория_ВидыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/омг_ДополнительныеФормы/Forms/УникальноеШтрихкодирование/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсходныеДанные = Параметры.МассивБиоматериалов;
	ИсходныеДанныеАдрес = ПоместитьВоВременноеХранилище(ИсходныеДанные, УникальныйИдентификатор);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОказаниеУслуг.Филиал КАК Филиал
	               |ИЗ
	               |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	               |ГДЕ
	               |	ОказаниеУслуг.Ссылка В(&СсылкиНаДокументы)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка В(&СсылкиНаДокументы)";
	Запрос.УстановитьПараметр("СсылкиНаДокументы", Параметры.Документы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Филиалы.Добавить(Выборка.Филиал);
	КонецЦикла;
	
	
	Для Каждого ДанныеБиоматериала Из ИсходныеДанные Цикл
		ЕстьУШК = Не Параметры.БиоматериалыСУШК.Найти(ДанныеБиоматериала.Биоматериал) = Неопределено;
		
		Если ЕстьУШК Тогда
			
			Для Каждого ДанныеИсследования Из ДанныеБиоматериала.Анализы Цикл
				СтрокаСписка = СписокБиоматериалов.Добавить();
				СтрокаСписка.Биоматериал = ДанныеБиоматериала.Биоматериал;
				СтрокаСписка.Контейнер = ДанныеБиоматериала.Контейнер;
				СтрокаСписка.Номенклатура = ДанныеИсследования.Номенклатура;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	ТаблицаКонтейнеров = СписокБиоматериалов.Выгрузить();
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаКонтейнеров.Биоматериал КАК Биоматериал,
	|	ТаблицаКонтейнеров.Контейнер КАК Контейнер,
	|	ТаблицаКонтейнеров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТаблицаКонтейнеров
	|ИЗ
	|	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКонтейнеров.Биоматериал КАК Биоматериал,
	|	ВТ_ТаблицаКонтейнеров.Контейнер КАК Контейнер,
	|	ВТ_ТаблицаКонтейнеров.Номенклатура КАК Номенклатура,
	|	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора КАК омг_КодГруппыЗабора
	|ИЗ
	|	РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаКонтейнеров КАК ВТ_ТаблицаКонтейнеров
	|		ПО ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал = ВТ_ТаблицаКонтейнеров.Биоматериал
	|			И ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер = ВТ_ТаблицаКонтейнеров.Контейнер
	|			И ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура = ВТ_ТаблицаКонтейнеров.Номенклатура
	|ГДЕ
	|	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал В(&Филиалы)";
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураПоиска = Новый Структура("Биоматериал, Контейнер, Номенклатура");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		СписокБиоматериалов.НайтиСтроки(СтруктураПоиска)[0].ГруппаЗабора = Выборка.омг_КодГруппыЗабора;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокБиоматериаловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокБиоматериаловПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтметкиПозиций(ОтмеченныеПозиции, ДопПараметры) Экспорт
	
	Если ОтмеченныеПозиции = Неопределено
		Или ОтмеченныеПозиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Номенклатура, Биоматериал");
	
	Для Каждого Позиция Из ОтмеченныеПозиции Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Позиция);
		СписокБиоматериалов.НайтиСтроки(СтруктураПоиска)[0].Штрихкод = ДопПараметры.Штрихкод;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаШтрихкода(Штрихкод, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	Для Каждого СтрокаСписка Из СписокБиоматериалов Цикл
		Если Не СтрокаСписка.Штрихкод = "" Тогда
			Продолжить;
		КонецЕсли;
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Номенклатура", СтрокаСписка.Номенклатура);
		СтруктураСтроки.Вставить("Биоматериал", СтрокаСписка.Биоматериал);
		СтруктураСтроки.Вставить("Контейнер", СтрокаСписка.Контейнер);
		СтруктураСтроки.Вставить("ГруппаЗабора", СтрокаСписка.ГруппаЗабора);
		МассивСтрок.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Штрихкод", Штрихкод);
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтметкиПозиций", ЭтаФорма, ПараметрыОповещения);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокЗначений", МассивСтрок);
	ПараметрыОткрытия.Вставить("Филиалы", Филиалы);
	ПараметрыОткрытия.Вставить("Штрихкод", Штрихкод);
	ПараметрыОткрытия.Вставить("СписокБиоматериалов", СписокБиоматериалов);
	
	ОткрытьФорму("Обработка.омг_ДополнительныеФормы.Форма.ОтметкаПозиций", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры



&НаКлиенте
Асинх Процедура ВвестиШтрихкод(Команда)
	
	СписокКонтейнеров = Новый СписокЗначений;
	СписокКонтейнеров.Добавить(0, "Новый контейнер");
	
	Для Каждого СтрокаТаблицы Из СписокБиоматериалов Цикл
		Если СписокКонтейнеров.НайтиПоЗначению(СтрокаТаблицы.Штрихкод) = Неопределено Тогда
			СписокКонтейнеров.Добавить(СтрокаТаблицы.Штрихкод, "Контейнер " + СтрокаТаблицы.Штрихкод);
		КонецЕсли;
	КонецЦикла;
	
	СписокКонтейнеров.СортироватьПоЗначению();
	
	ВыбКонтейнер = Ждать СписокКонтейнеров.ВыбратьЭлементАсинх("Выберите контейнер");
	
	Если ВыбКонтейнер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СписокБиоматериалов.ТекущиеДанные;
	
	ЕстьЕщеШтрихкоды = Ложь;
	
	ГруппаЗабораКонтейнера = "";
	
	НайденныеСтроки = СписокБиоматериалов.НайтиСтроки(Новый Структура("Штрихкод", ВыбКонтейнер.Значение));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ГруппаЗабораКонтейнера = НайденныеСтроки[0].ГруппаЗабора;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаЗабораКонтейнера) И Не ТекущаяСтрока.ГруппаЗабора = ГруппаЗабораКонтейнера Тогда
		ПоказатьПредупреждение(, "В контейнере уже есть биоматериалы другой группы забора!");
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Штрихкод > 0 Тогда
		ЕстьЕщеШтрихкоды = СписокБиоматериалов.НайтиСтроки(Новый Структура("Штрихкод", ТекущаяСтрока.Штрихкод)).Количество() > 1;
	КонецЕсли;
	
	Если ТекущаяСтрока.Штрихкод = 0 И ВыбКонтейнер.Значение = 0 Тогда
		ТекущаяСтрока.Штрихкод = СписокКонтейнеров[СписокКонтейнеров.Количество() - 1].Значение + 1;
	ИначеЕсли Не ТекущаяСтрока.Штрихкод = 0 И ВыбКонтейнер.Значение = 0 И ЕстьЕщеШтрихкоды Тогда
		ТекущаяСтрока.Штрихкод = СписокКонтейнеров[СписокКонтейнеров.Количество() - 1].Значение + 1;
	ИначеЕсли (ЕстьЕщеШтрихкоды И ТекущаяСтрока.Штрихкод = 0) Или ВыбКонтейнер.Значение > 0 Тогда
		ТекущаяСтрока.Штрихкод = ВыбКонтейнер.Значение;
	КонецЕсли;
	
	МинимальныйНомер = 1;
	МаксимальныйНомер = 1;
	
	Для Каждого СтрокаТаблицы Из СписокБиоматериалов Цикл
		Если СтрокаТаблицы.Штрихкод = 0 Тогда
			Продолжить;
		КонецЕсли;
		МинимальныйНомер = Мин(СтрокаТаблицы.Штрихкод, МинимальныйНомер);
		МаксимальныйНомер = Макс(СтрокаТаблицы.Штрихкод, МаксимальныйНомер);
	КонецЦикла;
	
	Для Номер = МинимальныйНомер По МаксимальныйНомер Цикл
		НеНайден = СписокБиоматериалов.НайтиСтроки(Новый Структура("Штрихкод", Номер)).Количество() = 0;
		Если НеНайден Тогда
			Для Каждого СтрокаТаблицы Из СписокБиоматериалов Цикл
				Если СтрокаТаблицы.Штрихкод > Номер Тогда
					СтрокаТаблицы.Штрихкод = СтрокаТаблицы.Штрихкод - 1;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ИндексТекущейСтроки = СписокБиоматериалов.Индекс(ТекущаяСтрока);
	Если Не ИндексТекущейСтроки + 1 = СписокБиоматериалов.Количество() Тогда
		Элементы.СписокБиоматериалов.ТекущаяСтрока = СписокБиоматериалов.Получить(ИндексТекущейСтроки + 1).ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОПрименении(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныеДанные = ПолучитьИзВременногоХранилища(ИсходныеДанныеАдрес);
	
	СписокБиоматериалов.Сортировать("Штрихкод");
	
	Штрихкоды = Новый Соответствие;
	Для Каждого СтрокаСписка Из СписокБиоматериалов Цикл
		ДанныеШтрихкода = Штрихкоды.Получить(СтрокаСписка.Штрихкод);
		Если ДанныеШтрихкода = Неопределено Тогда
			ПереченьШтрихкода = Новый Массив;
			Штрихкоды.Вставить(СтрокаСписка.Штрихкод, Новый Структура("ПереченьШтрихкода, ДанныеБиоматериала", ПереченьШтрихкода));
		Иначе
			ПереченьШтрихкода = ДанныеШтрихкода.ПереченьШтрихкода;
		КонецЕсли;
		ПереченьШтрихкода.Добавить(СтрокаСписка);
	КонецЦикла;
	
	УдаляемыеАнализы = Новый Массив;
	
	Для Каждого ДанныеШтрихкода Из Штрихкоды Цикл
		Для Каждого ПозицияУШК Из ДанныеШтрихкода.Значение.ПереченьШтрихкода Цикл
			
			Для Каждого ДанныеБиоматериала Из ИсходныеДанные Цикл
				
				Если Не ДанныеБиоматериала.Биоматериал = ПозицияУШК.Биоматериал Тогда
					Продолжить;
				КонецЕсли;
				УдаляемыеАнализы.Очистить();
				Для Каждого ДанныеАнализа Из ДанныеБиоматериала.Анализы Цикл
					Если Не ДанныеАнализа.Номенклатура = ПозицияУШК.Номенклатура Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не ДанныеШтрихкода.Значение.ДанныеБиоматериала = Неопределено Тогда
						НовыеДанныеБиоматериала = ДанныеШтрихкода.Значение.ДанныеБиоматериала;
					Иначе
						НовыеДанныеБиоматериала = омг_ЗаявкаЛИСОбщиеКлиентСерверныеПроцедуры.СкопироватьРекурсивно(ДанныеБиоматериала);
						НовыеДанныеБиоматериала.Анализы.Очистить();
						ДанныеШтрихкода.Значение.ДанныеБиоматериала = НовыеДанныеБиоматериала;
					КонецЕсли;
					
					НовыеДанныеБиоматериала.Анализы.Добавить(ДанныеАнализа);
					УдаляемыеАнализы.Добавить(ДанныеАнализа);
					
				КонецЦикла;
				Для Каждого ДанныеАнализа Из УдаляемыеАнализы Цикл
					ДанныеБиоматериала.Анализы.Удалить(ДанныеБиоматериала.Анализы.Найти(ДанныеАнализа));
				КонецЦикла;
				
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Для Индекс = -(ИсходныеДанные.Количество()-1) По 0 Цикл
		ДанныеБиоматериала = ИсходныеДанные.Получить(-Индекс);
		Если ДанныеБиоматериала.Анализы.Количество() = 0 Тогда
			ИсходныеДанные.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ДанныеШтрихкода Из Штрихкоды Цикл
		ИсходныеДанные.Добавить(ДанныеШтрихкода.Значение.ДанныеБиоматериала);
	КонецЦикла;
	
	Закрыть(ИсходныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУШК(Команда)
	
	ТекстВопроса = "Применить УШК к выбранным позициям?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОПрименении", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик_ПослеВводаШтрихкода(Данные, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокБиоматериаловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВвестиШтрихкод(Неопределено);
КонецПроцедуры
